app/views/semesters/index.html.erb


					<p><%= pluralize semester.sections.count, "section" %></p>
---
SELECT COUNT(*) FROM "sections" WHERE "sections"."semester_id" = 7