app/views/assignments/index.html.erb

SELECT "courses".* FROM "courses" WHERE "courses"."id" = 3 LIMIT 1
SELECT COUNT(*) FROM "materials" WHERE "materials"."course_id" = 1
---

<% if @section.course.materials.size > 0 %>

SELECT "examples".* FROM "examples" WHERE "examples"."section_id" = 1 ORDER BY created_at desc
SELECT COUNT(*) FROM "examples" WHERE "examples"."section_id" = 1
---

<% if @section.examples.size > 0 %>