app/views/assignments/index.html.erb

SELECT "steps".* FROM "steps" WHERE "steps"."how_to_id" = 1 ORDER BY position LIMIT 1
---

		<% xxx@xxx.xxx > 0 %>
			<article>
				<header><h1>Tutorials</h1></header>
				<ul id="tutorials">
xxx@xxx.xxx do |howto| %>
						<li>
							<%= link_to xxx@xxx.xxx howto, howto.steps.find( :first ) ) do %>