app/views/assignments/show.html.erb

	<table>
		<% @assignment.lab.requirements.each do |r| %>
---
SELECT "requirements".* FROM "requirements" WHERE "requirements"."lab_id" = 1


<% if @assignment.lab.extras.size > 0 %>
---
SELECT COUNT(*) FROM "extras" WHERE "extras"."lab_id" = 1