app/controllers/admin/admin_controller.rb

  def index
    @semesters = Semester.order('start_date desc').limit(5)
---
SELECT "semesters".* FROM "semesters" ORDER BY start_date desc LIMIT 5