app/controllers/admin/assignment_tweets_controller.rb

SELECT "assignments".* FROM "assignments" WHERE "assignments"."id" = ? LIMIT 1  [["id", "1-Lab02"]]
SELECT "sections".* FROM "sections" WHERE "sections"."id" = 1 LIMIT 1
---
  def new
    @assignment = Assignment.find params[:assignment_id]

    @content = "#{@assignment.title} for"

    unless @assignment.section.days.empty?

SELECT "assignments".* FROM "assignments" WHERE "assignments"."id" = ? LIMIT 1  [["id", "12"]]
---
  def create
    respond_to do |format|
      @assignment = Assignment.find params[:assignment_id]