app/controllers/admin/assignments_controller.rb

SELECT "semesters".* FROM "semesters" WHERE "semesters"."id" = ? LIMIT 1  [["id", "1-Fall2012"]]
---
  def load_semester
    @semester = Semester.find( params[:semester_id] )

SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", "3-Blahing-your-Blah"]]
---
  def load_section
    @section = Section.find( params[:section_id] )

SELECT "assignments".* FROM "assignments" WHERE ("assignments".section_id = 1) ORDER BY duedate desc
---
  def index
    @assignments = @section.assignments.order('duedate desc')

SELECT "assignments".* FROM "assignments" WHERE "assignments"."section_id" = 1 AND "assignments"."id" = ? ORDER BY duedate desc LIMIT 1  [["id", "4-Lab03"]]
---
  def show
    @assignment = @section.assignments.find(params[:id])

SELECT "assignments".* FROM "assignments" WHERE "assignments"."section_id" = 1 AND "assignments"."id" = ? ORDER BY duedate desc LIMIT 1  [["id", "4-Lab03"]]
---
  def edit
    @assignment = @section.assignments.find(params[:id])

INSERT INTO "assignments" ("created_at", "duedate", "lab_id", "section_id", "short_url", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @assignment = @section.assignments.build(allowed_params)

    respond_to do |format|
      if @assignment.save

SELECT "assignments".* FROM "assignments" WHERE "assignments"."section_id" = 1 AND "assignments"."id" = ? ORDER BY duedate desc LIMIT 1  [["id", "4-Lab03"]]
UPDATE "assignments" SET "duedate" = '2012-03-15 04:59:00.000000', "updated_at" = '2012-02-28 21:19:01.167835' WHERE "assignments"."id" = 14
---
  def update
    @assignment = @section.assignments.find(params[:id])
    old_duedate = @assignment.duedate

    respond_to do |format|
      if @assignment.update_attributes(allowed_params)