app/controllers/admin/courses_controller.rb

  def index
   xxx@xxx.xxx = Course.find(:all)
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = 1 LIMIT 1

  def show
   xxx@xxx.xxx = Course.find(params[:id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "1-How-to-Program"]]