app/controllers/admin/enrollment_statuses_controller.rb

SELECT "enrollment_statuses".* FROM "enrollment_statuses"
---
  def index
   xxx@xxx.xxx = EnrollmentStatus.all

SELECT "enrollment_statuses".* FROM "enrollment_statuses" WHERE "enrollment_statuses"."id" = 3 LIMIT 1
---
  def edit
   xxx@xxx.xxx = EnrollmentStatus.find(params[:id])