app/controllers/admin/enrollments_controller.rb

SELECT "semesters".* FROM "semesters" WHERE "semesters"."id" = ? LIMIT 1  [["id", "1-Fall2012"]]
---
  def load_semester
    @semester = Semester.find(params[:semester_id])

SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", "1-How-to-Program"]]
---
  def load_section
    @section = Section.find(params[:section_id])

SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."section_id" = 1 AND "enrollments"."id" = ? LIMIT 1  [["id", "3"]]
---
  def show
    @enrollment = @section.enrollments.find(params[:id])

SELECT "students".* FROM "students" WHERE (email = xxx@xxx.xxx LIMIT 1
---
  def create
    @existing_student = Student.where("email = ?", params[:email]).first