app/controllers/admin/general_contacts_controller.rb

  def index
    @general_contacts = GeneralContact.order('created_at desc')
---
SELECT "general_contacts".* FROM "general_contacts" ORDER BY created_at desc

  def show
    @general_contact = GeneralContact.find(params[:id])
---
SELECT "general_contacts".* FROM "general_contacts" WHERE "general_contacts"."id" = 1 LIMIT 1

  def destroy
    @general_contact = GeneralContact.find(params[:id])
    @general_contact.destroy
---
SELECT "general_contacts".* FROM "general_contacts" WHERE "general_contacts"."id" = 1 LIMIT 1
DELETE FROM "general_contacts" WHERE "general_contacts"."id" = 1