app/controllers/admin/grade_requests_controller.rb

  def index
   xxx@xxx.xxx = GradeRequest.order('created_at desc')
---
SELECT "grade_requests".* FROM "grade_requests" ORDER BY created_at desc