app/controllers/admin/homework_return_requests_controller.rb

  def index
   xxx@xxx.xxx = HomeworkReturnRequest.order('created_at desc')
---
SELECT "homework_return_requests".* FROM "homework_return_requests" ORDER BY created_at desc

  def show
   xxx@xxx.xxx = HomeworkReturnRequest.find(params[:id])
---
SELECT "homework_return_requests".* FROM "homework_return_requests" WHERE "homework_return_requests"."id" = 1 LIMIT 1