app/controllers/admin/how_tos_controller.rb

  def load_course
    @course = Course.find( params[:course_id] )
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = 1 LIMIT 1