app/controllers/admin/how_tos_controller.rb

  def index
   xxx@xxx.xxx = HowTo.all
---
SELECT "how_tos".* FROM "how_tos"

  def show
   xxx@xxx.xxx = HowTo.find(params[:id])
---
SELECT "how_tos".* FROM "how_tos" WHERE "how_tos"."id" = ? LIMIT 1  [["id", "1-Sample-How-To"]]