app/controllers/admin/instructors_controller.rb

  def show
    @instructor = Instructor.find(params[:id])
---
SELECT "instructors".* FROM "instructors" WHERE "instructors"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @instructor = Instructor.find(params[:id])
---
SELECT "instructors".* FROM "instructors" WHERE "instructors"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    @instructor = Instructor.find(params[:id])

    respond_to do |format|
      if @instructor.update_attributes(allowed_params)
---
SELECT "instructors".* FROM "instructors" WHERE "instructors"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "instructors" SET "twitter_handle" = 'professorsinger', "updated_at" = '2012-02-27 14:39:19.070941' WHERE "instructors"."id" = 1