app/controllers/admin/labs_controller.rb

  def load_course
    @course = Course.find(params[:course_id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "2-Blahing-your-Blah"]]

  def create
    @lab = @course.labs.build(allowed_params)

    respond_to do |format|
      if @lab.save
---
INSERT INTO "labs" ("allow_uploads", "course_id", "created_at", "instructions", "objective", "title", "updated_at", "visible") VALUES (?, ?, ?, ?, ?, ?, ?, ?)