app/controllers/admin/sections_controller.rb

  def load_semester
    @semester = Semester.find( params[:semester_id] )
---
SELECT "semesters".* FROM "semesters" WHERE "semesters"."id" = ? LIMIT 1  [["id", "1-Fall2012"]]

  def index
    @sections = @semester.sections.all
---
SELECT "sections".* FROM "sections" WHERE ("sections".semester_id = 1)

  def show
    @section = @semester.sections.find(params[:id])
---
SELECT "sections".* FROM "sections" WHERE "sections"."semester_id" = 1 AND "sections"."id" = ? LIMIT 1  [["id", "1-How-to-Program"]]

  def edit
    @section = @semester.sections.find(params[:id])
---
SELECT "sections".* FROM "sections" WHERE "sections"."semester_id" = 1 AND "sections"."id" = ? LIMIT 1  [["id", "1-How-to-Program"]]

  def update
    @section = @semester.sections.find(params[:id])

    respond_to do |format|
      if @section.update_attributes(allowed_params)
---
SELECT "sections".* FROM "sections" WHERE "sections"."semester_id" = 1 AND "sections"."id" = ? LIMIT 1  [["id", "1-How-to-Program"]]
UPDATE "sections" SET "meeting_days" = 'M W', "updated_at" = '2012-02-26 21:37:56.171442' WHERE "sections"."id" = 1

  def export_gradebook
    @section = @semester.sections.find(params[:id])

    csv_string = CSV.generate do |csv|
      assignments = @section.assignments.except(:order).order(:duedate).all

      csv << ["Tulsa Community College"]
      csv << [@section.instructor.name,"", "Grade Scale", "A = 90-100%"]
      csv << [APP_CONFIG['ted_username'],"","","B = 80-89%"]
      csv << [@section.course.title,"","","C = 70-79%"]
      csv << ["#{@section.course.short_name} - (#{@section.call_number})","","","D = 60-69%"]
      csv << ["#{@section.semester.season}/#{@section.semester.year} (#{@section.semester.numeric})","","","F = < 60%"]
      csv << [] #blank row

      assignments_header = ["STUDENT NAME",	"Letter Grade",	"% Grade",	"Total Points",	"Total Absence",	"Participation", ""]
      assignments_header << assignments.map {|assignment| "#{assignment.title} - #{assignment.lab.title}"}
      csv << assignments_header.flatten

      @section.enrollments.each do |enrollment|
---
SELECT "sections".* FROM "sections" WHERE "sections"."semester_id" = 1 AND "sections"."id" = ? LIMIT 1  [["id", "1-How-to-Program"]]
SELECT "assignments".* FROM "assignments" WHERE "assignments"."section_id" = 1 ORDER BY duedate desc, duedate asc
SELECT "labs".* FROM "labs" WHERE "labs"."id" = 1 LIMIT 1
SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."section_id" = 1



        assignments.each do |assignment|
          work = enrollment.works.where("assignment_id = ?", assignment.id).limit(1)
---
SELECT "works".* FROM "works" WHERE "works"."enrollment_id" = 3 AND (assignment_id = 1) LIMIT 1