app/controllers/admin/sections_controller.rb

  def export_gradebook
    @section xxx@xxx.xxx

    csv_string = CSV.generate do |csv|
      assignments xxx@xxx.xxx

      assignments_header = ["assignments"]
      assignments_header << assignments.map {|assignment| "#{assignment.title} - #{assignment.lab.title}"}
      csv << assignments_header.flatten

      worth_header = ["worth"]
      worth_header << assignments.map {|assignment| assignment.worth}
      csv << worth_header.flatten

     xxx@xxx.xxx do |enrollment|
        line = []
        line << enrollment.student.last_name_first

        assignments.each do |assignment|
          work = enrollment.works.where("assignment_id = ?", assignment.id).limit(1)
---
SELECT "students".* FROM "students" WHERE "students"."id" = 1 LIMIT 1