app/controllers/admin/semesters_controller.rb

SELECT "semesters".* FROM "semesters" ORDER BY start_date desc
---
  def index
   xxx@xxx.xxx = Semester.order('start_date desc')

SELECT "semesters".* FROM "semesters" WHERE "semesters"."id" = 1 LIMIT 1
---
  def show
   xxx@xxx.xxx = Semester.find(params[:id])

SELECT "semesters".* FROM "semesters" WHERE "semesters"."id" = ? LIMIT 1  [["id", "3-Fall1997"]]
---
  def edit
   xxx@xxx.xxx = Semester.find(params[:id])