app/controllers/admin/steps_controller.rb

  def load_howto
    @how_to = HowTo.find( params[:how_to_id] )
---
SELECT "how_tos".* FROM "how_tos" WHERE "how_tos"."id" = ? LIMIT 1  [["id", "1-Sample-How-To"]]

  def load_course
    @course = Course.find(params[:course_id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = 1 LIMIT 1

  def create
    @step = @how_to.steps.build(allowed_params)

    respond_to do |format|
      if @step.save
---
INSERT INTO "steps" ("created_at", "how_to_id", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "instructions", "position", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def sort
    @how_to.steps.all.each do |step|
      if position = params[:steps].index(step.id.to_s)
        step.update_attribute(:position, position + 1) unless step.position == position + 1
---
SELECT "steps".* FROM "steps" WHERE "steps"."how_to_id" = 1 ORDER BY position DESC LIMIT 1
UPDATE "steps" SET "position" = 2, "updated_at" = '2011-10-11 15:14:10.119456' WHERE "steps"."id" = 3