app/controllers/admin/students_controller.rb

  def create
   xxx@xxx.xxx = Student.new(allowed_params)

    respond_to do |format|
      xxx@xxx.xxx
       xxx@xxx.xxx = Enrollment.new
        @enrollment.student_id xxx@xxx.xxx
        @enrollment.section_id xxx@xxx.xxx

       xxx@xxx.xxx = EnrollmentStatus.where("name = 'Enrolled'").first
---
SELECT "enrollment_statuses".* FROM "enrollment_statuses" WHERE (name = 'Enrolled') LIMIT 1