app/controllers/admin/students_controller.rb

  def load_semester
    @semester = Semester.find(params[:semester_id])
---
SELECT "semesters".* FROM "semesters" WHERE "semesters"."id" = ? LIMIT 1  [["id", "1-Fall2012"]]

  def load_section
    @section = Section.find(params[:section_id])
---
SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", "1-How-to-Program"]]

  def create
    @student = Student.new(allowed_params)

    respond_to do |format|
      if @student.save
        @enrollment = Enrollment.new
        @enrollment.student_id = @student.id
        @enrollment.section_id = @section.id

        @enrollment.enrollment_status = EnrollmentStatus.enrolled

        @enrollment.save
---
INSERT INTO "students" ("created_at", "email", "first_name", "goes_by", "last_name", "middle_name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
INSERT INTO "enrollments" ("created_at", "enrollment_status_id", "section_id", "student_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 11 Oct 2011 11:51:45 CDT -05:00], ["enrollment_status_id", 1], ["section_id", 1], ["student_id", 2], ["updated_at", Tue, 11 Oct 2011 11:51:45 CDT -05:00]]