app/controllers/admin/waiters_controller.rb

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "1-How-to-Program"]]
---
  def load_course
    @course = Course.find( params[:course_id] )

SELECT "waiters".* FROM "waiters" WHERE "waiters"."course_id" = 1
---
  def index
    @waiters = @course.waiters.all

SELECT "waiters".* FROM "waiters" WHERE "waiters"."course_id" = 1 AND "waiters"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "waiters" WHERE "waiters"."id" = ?  [["id", 2]]
---
  def destroy
    @waiter = @course.waiters.find(params[:id])
    @waiter.destroy