app/controllers/admin/works_controller.rb

SELECT "semesters".* FROM "semesters" WHERE "semesters"."id" = ? LIMIT 1  [["id", "1-Fall2012"]]
SELECT "assignments".* FROM "assignments" WHERE "assignments"."id" = ? LIMIT 1  [["id", "3-Lab01"]]
SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", "1-How-to-Program"]]
SELECT "works".* FROM "works" WHERE "works"."assignment_id" = 3 AND "works"."id" = ? LIMIT 1  [["id", "1"]]
---
  def load_semester
    if params[:semester_id]
      @semester = Semester.find( params[:semester_id] )
    else
      @semester = Work.find(params[:id]).assignment.section.semester

SELECT "enrollments".* FROM "enrollments" WHERE ("enrollments".section_id = 1)
SELECT "works".* FROM "works" WHERE "works"."enrollment_id" = 3 AND "works"."assignment_id" = 3 LIMIT 1
---
  def index
    @works = @assignment.works.order(:created_at)

    @enrollments_without_works = Array.new

    @section.enrollments.each do |enrollment|
      if not enrollment.works.find_by_assignment_id( @assignment )

INSERT INTO "works" ("assignment_id", "created_at", "email", "enrollment_id", "instructors_comments", "updated_at", "upload_content_type", "upload_file_name", "upload_file_size", "upload_updated_at", "withdrawal_code") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @work = @assignment.works.build(allowed_params)

    respond_to do |format|
      if @work.enrollment
        @work.email = @work.enrollment.student.email
      end

      if @work.save

UPDATE "works" SET "enrollment_id" = 6, "updated_at" = '2011-10-11 16:55:55.866841' WHERE "works"."id" = 4
---
  def update
    @work = @assignment.works.find(params[:id])

    respond_to do |format|
      if @work.update_attributes(allowed_params)

UPDATE "works" SET "instructors_comments" = 'Your file is lame.', "updated_at" = '2011-10-11 16:54:08.662431' WHERE "works"."id" = 6
SELECT "labs".* FROM "labs" WHERE "labs"."id" = 1 LIMIT 1
SELECT "requirements".* FROM "requirements" WHERE "requirements"."id" = ? LIMIT 1  [["id", "1"]]
SELECT COUNT(*) FROM "awarded_points" WHERE "awarded_points"."work_id" = 1
SELECT COUNT(*) FROM "requirements" WHERE "requirements"."lab_id" = 1
INSERT INTO "awarded_points" ("created_at", "points", "requirement_id", "updated_at", "work_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 11 Oct 2011 11:53:54 CDT -05:00], ["points", nil], ["requirement_id", nil], ["updated_at", Tue, 11 Oct 2011 11:53:54 CDT -05:00], ["work_id", nil]]
UPDATE "awarded_points" SET "work_id" = 1, "requirement_id" = 1, "points" = 100, "updated_at" = '2011-10-11 16:53:54.812494' WHERE "awarded_points"."id" = 4
---
  def record_score
    @work = @assignment.works.find(params[:id])

    respond_to do |format|
      if @work.update_attributes(allowed_params)
        #ap[0] is the requirements id
        #ap[1] is the earned points submitted from the form

        # if no points have been previously awarded for this work
        if @work.awarded_points.size < @work.assignment.lab.requirements.size
          #create a new set of awarded points for it
          params[:awarded_points].each do |point_id, amount|
            awarded_point = AwardedPoint.create
            awarded_point.update_attributes(work: @work, requirement: Requirement.find(point_id), points: amount)