app/views/admin/sections/index.html.erb

SELECT "courses".* FROM "courses" WHERE "courses"."id" = 1 LIMIT 1
SELECT "sections".* FROM "sections" WHERE "sections"."semester_id" = 1
SELECT COUNT(*) FROM "enrollments" WHERE "enrollments"."section_id" = 1
SELECT COUNT(*) FROM "sections" WHERE "sections"."semester_id" = 1
---
				if($("#enrollments_chart").size( ) > 0) {
					var chart = new Highcharts.Chart({
						chart: {
							renderTo: 'enrollments_chart',
							type: 'spline',
							events: {
	              load: function() {
	                $(window).resize();
	              }
	            }
						},
						title: { text: 'Enrollments by Day' },
						xAxis: { type: 'datetime' },
						yAxis: {
							title: { text: '# of Students'},
							min: 0
						},
						series: [
						<% @semester.sections.all.each do |section| %>
							<%# if section.enrollment_snapshots.count > 0 %>
								{
									name: "<%= section.meeting_days %> <%= section.course.title %>",