app/views/admin/sections/show.html.erb

SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."student_id" = 1 AND (section_id = 1) LIMIT 1
SELECT COUNT(*) FROM "students" INNER JOIN "enrollments" ON "students"."id" = "enrollments"."student_id" WHERE "enrollments"."section_id" = 1
SELECT "students".* FROM "students" INNER JOIN "enrollments" ON "students"."id" = "enrollments"."student_id" WHERE "enrollments"."section_id" = 1
---
				<th>Attendance</th>
				<th>Email</th>
				<th></th>
				<th></th>
			</tr>
xxx@xxx.xxx { |x,y| x.student.last_name <=> y.student.last_name }.each do |enrollment| %>
				<tr>
					<td>
						<%= link_to enrollment.student.first_name + ' ' + (enrollment.student.middle_name || "") + ' ' + enrollment.student.last_name, xxx@xxx.xxx %>
					</td>
					<td><%= enrollment.enrollment_status ? enrollment.enrollment_status.name : "unknown" %></td>
					<td>
						<%= enrollment.attendances.where("attendance_status_id != ? and attendance_status_id is not null", AttendanceStatus.absent).size %> / xxx@xxx.xxx %>
					</td>
					<td>
						<%= mail_to enrollment.student.email %>
					</td>
					<td class="show">
						<%= link_to 'History', admin_student_path(enrollment.student) %>
					</td>
					<td class="deenroll">
						<%= link_to 'De-Enroll', xxx@xxx.xxx @section, enrollment ), :method => :delete, :confirm => 'Are you sure?' %>