app/views/shared/_footer.html.erb

SELECT "instructors".* FROM "instructors"
---

		<% Instructor.all.each do |instructor| %>

SELECT "sections".* FROM "sections" WHERE ("sections".semester_id = 1)
---
			<li><h3><%= semester.name %> Classes</h3></li>
			<% semester.sections.each do |section| %>

SELECT "courses".* FROM "courses" WHERE "courses"."id" = 1 LIMIT 1
---
		<li><h3>All Courses</h3></li>
		<% Course.find(:all).each do |course| %>