app/views/sections/syllabus.html.erb

						<strong>
							<%= @section.instructor.first_name %> <%= @section.instructor.last_name %>
---
SELECT "instructors".* FROM "instructors" WHERE "instructors"."id" = 1 LIMIT 1


			<% if @section.course.books.size > 0 %>
---
SELECT "books".* FROM "books" WHERE "books"."course_id" = 3
SELECT "courses".* FROM "courses" WHERE "courses"."id" = 3 LIMIT 1

			<ol>
				<% @section.course.objectives.each do |o| %>
---
SELECT "objectives".* FROM "objectives" WHERE "objectives"."course_id" = 3


		<% @section.course.policies.each do |policy| %>
---
SELECT "policies".* FROM "policies" WHERE "policies"."course_id" = 3 ORDER BY position