app/views/admin/instructors/_form.html.erb

SELECT "instructors".* FROM "instructors" WHERE "instructors"."id" = ? LIMIT 1  [["id", "1"]]
---

		<li><div class="details"><%= f.label :division %><p></p></div><div class="field"><%=  select( "instructor", "division_id", Division.find( :all ).collect {|s| [ s.name, s.id ] }, { :include_blank => true } ) %></div></li>