app/views/admin/instructors/_form.html.erb


		<li><div class="details"><%= f.label :division %><p></p></div><div class="field"><%=  select( "instructor", "division_id", Division.all.collect {|s| [ s.name, s.id ] }, { include_blank: true } ) %></div></li>
---
SELECT "divisions".* FROM "divisions"