app/views/admin/assignments/_form.html.erb

SELECT "courses".* FROM "courses" WHERE "courses"."id" = 1 LIMIT 1
SELECT "labs".* FROM "labs" WHERE "labs"."id" = 3 LIMIT 1
---

				<div class="field"><%= f.collection_select( :lab_id, Lab.where(['course_id = ?', @section.course]), :id, :title, include_blank: true ) %></div>