app/views/admin/assignments/show.html.erb

	<table>
		<% @assignment.lab.requirements.each do |r| %>
---
SELECT "labs".* FROM "labs" WHERE "labs"."id" = 3 LIMIT 1
SELECT "requirements".* FROM "requirements" WHERE "requirements"."lab_id" = 3


<% if @assignment.lab.extras.size > 0 %>
---
SELECT "extras".* FROM "extras" WHERE "extras"."lab_id" = 1
SELECT COUNT(*) FROM "extras" WHERE "extras"."lab_id" = 3