app/views/admin/works/_form.html.erb

SELECT "assignments".* FROM "assignments"
---

			<div class="field"><%=  select( "work", "assignment_id", Assignment.all.collect {|s| [ s.title + ' - ' + s.lab.title, s.id ] }, { :include_blank => true } ) %></div>