app/views/admin/works/index.html.erb

SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."id" IS NULL LIMIT 1
SELECT "students".* FROM "students" WHERE "students"."id" = 1 LIMIT 1
---
						<% if work.enrollment %>
					    	<%= work.enrollment.student.last_name %>, <%= work.enrollment.student.first_name %>

SELECT "awarded_points".* FROM "awarded_points" WHERE "awarded_points"."work_id" = 1
SELECT COUNT(*) FROM "awarded_points" WHERE "awarded_points"."work_id" = 1
---

					<% if work.awarded_points.size > 0 %>

SELECT "assignments".* FROM "assignments" WHERE "assignments"."id" = 3 LIMIT 1
---
				<td>
					<%= work.assignment.average %>%