app/views/admin/works/show.html.erb

SELECT "assignments".* FROM "assignments" WHERE "assignments"."id" = 1 LIMIT 1
SELECT "labs".* FROM "labs" WHERE "labs"."id" = 1 LIMIT 1
SELECT "requirements".* FROM "requirements" WHERE "requirements"."lab_id" = 1
---

		<% @work.assignment.lab.requirements.each do |r| %>

SELECT "awarded_points".* FROM "awarded_points" WHERE "awarded_points"."work_id" = 4 AND (requirement_id=1) LIMIT 1
---
				<%
					awarded_point = @work.awarded_points.where(['requirement_id=?',r]).first