app/views/courses/show.html.erb

SELECT "steps".* FROM "steps" WHERE "steps"."how_to_id" = 1 ORDER BY position LIMIT 1
---

<% xxx@xxx.xxx > 0 %>
	<h4>Tutorials:</h4>
	<ul class="sliding">
xxx@xxx.xxx do |howto| %>
			<li>
				<%= link_to xxx@xxx.xxx howto, howto.steps.find( :first ) ) do %>

SELECT "semesters".* FROM "semesters" WHERE "semesters"."id" = 1 LIMIT 1
SELECT COUNT(*) FROM "enrollments" WHERE "enrollments"."section_id" = 1
---
				<%= link_to semester_section_path( section.semester, section ) do %>
					<%= section.semester.name %> <span style="font-size: .7em;">(<%= section.enrollments.size %> enrolled)</span>