app/controllers/assignments_controller.rb

  def load_section
    @section = Section.includes(:semester,:examples,:course).find( params[:section_id] )
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = 1 LIMIT 1
SELECT "examples".* FROM "examples" WHERE ("examples".section_id = 1) ORDER BY created_at desc
SELECT "sections".* FROM "sections" WHERE ("sections".semester_id = 1)
SELECT "semesters".* FROM "semesters" WHERE "semesters"."id" = 1 LIMIT 1

  def index
    @assignments = @section.assignments.includes(:lab).visible
---
SELECT "assignments".* FROM "assignments" INNER JOIN "labs" ON "labs"."id" = "assignments"."lab_id" WHERE ("assignments".section_id = 1) AND (labs.visible = 't') ORDER BY duedate desc

  def show
    @assignment = @section.assignments.find(params[:id])
---
SELECT "assignments".* FROM "assignments" WHERE "assignments"."section_id" = 1 AND "assignments"."id" = ? ORDER BY duedate desc LIMIT 1  [["id", "1-Lab02"]]