app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses"
---
  def index
   xxx@xxx.xxx = Course.all

SELECT "courses".* FROM "courses" WHERE "courses"."id" = 2 LIMIT 1
---
  def show
   xxx@xxx.xxx = Course.find(params[:id])

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "1-How-to-Program"]]
---
  def syllabus
   xxx@xxx.xxx = Course.find params[:id]