app/controllers/examples_controller.rb

SELECT "sections".* FROM "sections" WHERE "sections"."semester_id" = 1 LIMIT 1
SELECT "semesters".* FROM "semesters" ORDER BY start_date
---
  def test_flash
    flash[:notice] = 'This is a test flash notice message.'
    # flash[:error] = 'This is an example of a flash error'
    redirect_to semester_section_assignments_path( Semester.current, Semester.current.sections.first )