app/controllers/general_contacts_controller.rb

SELECT "sections".* FROM "sections" WHERE ("sections".semester_id = 1)
---
  def new
    if params[:section_id]
      @section = Section.find params[:section_id]

INSERT INTO "general_contacts" ("attachment_content_type", "attachment_file_name", "attachment_file_size", "attachment_updated_at", "body", "created_at", "return_email", "subject", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @general_contact = GeneralContact.new(allowed_params)

    if params[:section_id]
      @section = Section.find params[:section_id]
    end

    respond_to do |format|
      if @general_contact.save