app/controllers/grade_requests_controller.rb

SELECT "semesters".* FROM "semesters" WHERE "semesters"."id" = ? LIMIT 1  [["id", "1-Fall2012"]]
---
  def load_semester
    @semester = Semester.find( params[:semester_id] )

SELECT "sections".* FROM "sections" WHERE "sections"."semester_id" = 1 AND "sections"."id" = ? LIMIT 1  [["id", "1-How-to-Program"]]
---
  def load_section
    @section = @semester.sections.find( params[:section_id] )

SELECT "grade_requests".* FROM "grade_requests" WHERE "grade_requests"."section_id" = 1 AND (email = xxx@xxx.xxx ORDER BY created_at desc LIMIT 1
SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."section_id" = 1
INSERT INTO "grade_requests" ("created_at", "email", "enrollment_id", "section_id", "status", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Mon, 10 Oct 2011 10:41:46 CDT -05:00], ["email", xxx@xxx.xxx ["enrollment_id", nil], ["section_id", 1], ["status", nil], ["updated_at", Mon, 10 Oct 2011 10:41:46 CDT -05:00]]
---
  def create
  	# get previous requests made by someone with this email address
    prev_request = @section.grade_requests.where('email = ?', allowed_params[:email].downcase).first

    # create the grade request
    @grade_request= @section.grade_requests.build( allowed_params )

    # find the enrollment id for the student making the request
    @section.enrollments.each do |enrollment|
      if enrollment.student.email == allowed_params[:email].downcase
        @grade_request.enrollment_id = enrollment.id
      end
    end

    respond_to do |format|
      unless @grade_request.enrollment
      	# if no one in this section has the requesters email address it must be a request from a non-enrolled student
        @status = "failed"
        @grade_request.status = 'denied'
        @grade_request.errors.add :email, 'does not match any enrollments for this section.  Are you sure you are using your school email address and not a personal email address?';
        format.html { render action: "new" }
      else
        if @grade_request.save

UPDATE "grade_requests" SET "status" = 'denied', "updated_at" = '2011-10-10 15:41:46.236037' WHERE "grade_requests"."id" = 1
---
            @grade_request.send_email

            @status = semester_section_assignments_url(@semester,@section)
            @grade_request.update_attributes status: 'sent'