app/controllers/homework_return_requests_controller.rb

  def load_semester
    @semester = Semester.find( params[:semester_id] )
---
SELECT "semesters".* FROM "semesters" WHERE "semesters"."id" = 1 LIMIT 1

  def load_section
    @section = @semester.sections.find( params[:section_id] )
---
SELECT "sections".* FROM "sections" WHERE "sections"."id" = 1 AND ("sections".semester_id = 1) LIMIT 1

  def load_assignment
    @assignment = @section.assignments.find( params[:assignment_id] )
---
SELECT "assignments".* FROM "assignments" WHERE "assignments"."id" = 1 AND ("assignments".section_id = 1) ORDER BY duedate desc LIMIT 1