app/controllers/instructors_controller.rb

SELECT "instructors".* FROM "instructors" WHERE "instructors"."id" = 1 LIMIT 1
---
  def show
    @instructor = Instructor.find params[:id]