app/controllers/sections_controller.rb

SELECT "semesters".* FROM "semesters" WHERE "semesters"."id" = 1 LIMIT 1
---
  def load_semester
    @semester = Semester.find(params[:semester_id])

SELECT "courses".* FROM "courses"
SELECT "sections".* FROM "sections" WHERE ("sections".semester_id = 1)
---
  def index
    response.headers.delete "X-Frame-Options" #so the home page can be shown in a iframe
    @sections = @semester.sections.includes(:course).all

SELECT "sections".* FROM "sections" WHERE "sections"."semester_id" = 1 AND "sections"."id" = ? LIMIT 1  [["id", "7-Introduction-to-Java-Programming"]]
---
  def syllabus
    @section = @semester.sections.find(params[:id])