app/controllers/semesters_controller.rb

  def index
    @semesters = Semester.order('start_date desc')
---
SELECT "semesters".* FROM "semesters" ORDER BY start_date desc