app/controllers/steps_controller.rb

  def load_section
    @section = Section.find( params[:section_id] ) if params[:section_id]
---
SELECT "sections".* FROM "sections" WHERE ("sections".semester_id = 1)

  def load_course
    @course = Course.find( params[:course_id] )
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = 1 LIMIT 1

  def load_howto
    @how_to = HowTo.find( params[:how_to_id] )
---
SELECT "how_tos".* FROM "how_tos" WHERE "how_tos"."id" = 1 LIMIT 1

  def show
    unless session[:referrer]
      session[:referrer] = request.referrer
    end

    @step = Step.find(params[:id])
---
SELECT "steps".* FROM "steps" WHERE ("steps".how_to_id = 1) AND (position=0) ORDER BY position LIMIT 1