app/controllers/waiters_controller.rb

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "1-How-to-Program"]]
---
  def load_course
    @course = Course.find(params[:course_id])

INSERT INTO "waiters" ("course_id", "created_at", "email", "updated_at") VALUES (?, ?, ?, ?)  [["course_id", 1], ["created_at", Wed, 12 Oct 2011 09:53:07 CDT -05:00], ["email", xxx@xxx.xxx ["updated_at", Wed, 12 Oct 2011 09:53:07 CDT -05:00]]
---
  def create
    @waiter = @course.waiters.build(allowed_params)

    respond_to do |format|
      if @waiter.save