app/controllers/works_controller.rb

  def load_semester
    @semester = Semester.find( params[:semester_id] )
---
SELECT "semesters".* FROM "semesters" WHERE "semesters"."id" = ? LIMIT 1  [["id", "1-Fall2012"]]

  def load_section
    @section = Section.find( params[:section_id] )
---
SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", "1-How-to-Program"]]

  def load_assignment
    @assignment = Assignment.find( params[:assignment_id] )
---
SELECT "assignments".* FROM "assignments" WHERE "assignments"."id" = ? LIMIT 1  [["id", "1-Lab02"]]

  def create
    @work = @assignment.works.build(allowed_params)
    @work.email.downcase!

    respond_to do |format|
      # make this work one with the assignment
      @work.assignment_id = @assignment.id

      # try to find the student who this assignment belongs to (based on the submitting email address)
      student = Student.where('email=?', params[:work][:email].downcase).first

      if student
        # if a student is found with a matching email address attribute the assignment to them
        @work.enrollment = student.enrollments.where('section_id=?',@section.id).first
      end

      # check if a work has already been submitted from this submission address
      prev_works = @assignment.works.where('email=?', params[:work][:email].downcase)

      # if the work wasn't previously submitted
      if prev_works.size == 0
        # save the work
        if @work.save
---
SELECT "students".* FROM "students" WHERE (email='noah_singer') LIMIT 1
SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."student_id" = 1 AND (section_id=1) LIMIT 1
SELECT "works".* FROM "works" WHERE "works"."assignment_id" = 1 AND xxx@xxx.xxx
SELECT COUNT(*) FROM "works" WHERE "works"."assignment_id" = 1 AND (email='noah_singer')
INSERT INTO "works" ("assignment_id", "created_at", "email", "enrollment_id", "instructors_comments", "updated_at", "upload_content_type", "upload_file_name", "upload_file_size", "upload_updated_at", "withdrawal_code") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "works" SET "email" = xxx@xxx.xxx "upload_file_name" = 'Yearly Class Schedule.numbers', "upload_content_type" = 'application/octet-stream', "upload_file_size" = 98097, "upload_updated_at" = '2011-10-10 16:04:33.329021', "assignment_id" = 1, "enrollment_id" = 3, "created_at" = '2011-10-10 16:04:33.484375', "updated_at" = '2011-10-10 16:04:33.484375', "withdrawal_code" = '7d00d107726599a1101ca3fd6dcc323812638d56423defcdec60f0c3a548f1eb' WHERE "works"."id" = 5