app/views/student_mailer/grade_request.html.erb

									</tr>
									<% assignment.lab.requirements.each do |r| %>
---
SELECT "labs".* FROM "labs" WHERE "labs"."id" = 1 LIMIT 1
SELECT "requirements".* FROM "requirements" WHERE "requirements"."lab_id" = 1