app/views/student_mailer/grade_request.html.erb

SELECT "assignments".* FROM "assignments" WHERE "assignments"."section_id" = 1 ORDER BY duedate desc
SELECT "sections".* FROM "sections" WHERE "sections"."id" = 1 LIMIT 1
---

<%- @enrollment.section.assignments.each do |assignment| -%>

SELECT "works".* FROM "works" WHERE "works"."assignment_id" = 1 AND "works"."enrollment_id" = 3 LIMIT 1
---
	<div class="block works">
		<%- work = assignment.works.find_by_enrollment_id( @enrollment ) -%>

SELECT "awarded_points".* FROM "awarded_points" WHERE "awarded_points"."work_id" = 1
---
					</tr>
					<%- work.awarded_points.each do |p| -%>