app/views/student_mailer/grade_request.text.erb

SELECT "works".* FROM "works" WHERE "works"."assignment_id" = 1 AND "works"."enrollment_id" = 3 LIMIT 1
---
<%- @enrollment.section.assignments.each do |assignment| -%>
<%- work = assignment.works.find_by_enrollment_id( @enrollment ) -%>