app/views/admin/admin/index.html.erb

						<%= link_to admin_semesters_path do %>
							<h2>Semesters (<%= Semester.count %>)</h2>
---
SELECT "semesters".* FROM "semesters" ORDER BY start_date
SELECT COUNT(*) FROM "semesters"

						<%= link_to admin_courses_path do %>
							<h2>Courses (<%= Course.count %>)</h2>
---
SELECT COUNT(*) FROM "courses"

						<%= link_to admin_students_path do %>
							<h2>Students (<%= Student.count %>)</h2>
---
SELECT COUNT(*) FROM "students"

						<%= link_to admin_instructors_path do %>
							<h2>Instructors (<%= Instructor.count %>)</h2>
---
SELECT COUNT(*) FROM "instructors"

						<%= link_to admin_enrollment_statuses_path do %>
							<h2>Enrollments Statuses (<%= EnrollmentStatus.count %>)</h2>
---
SELECT COUNT(*) FROM "enrollment_statuses"

						<%= link_to admin_divisions_path do %>
							<h2>Divisions (<%= Division.count %>)</h2>
---
SELECT COUNT(*) FROM "divisions"

						<%= link_to admin_general_contacts_path do %>
							<h2><%= pluralize GeneralContact.count, "Contact" %></h2>
---
SELECT COUNT(*) FROM "general_contacts"

						<%= link_to admin_grade_requests_path do %>
							<h2><%= pluralize GradeRequest.count, "Grade Request" %></h2>
---
SELECT COUNT(*) FROM "grade_requests"

						<%= link_to admin_homework_return_requests_path do %>
							<h2><%= pluralize HomeworkReturnRequest.count, "Homework Return Request" %></h2>
---
SELECT COUNT(*) FROM "homework_return_requests"

						<% end %>
						<p><%= pluralize semester.sections.count, "section" %></p>
---
SELECT COUNT(*) FROM "sections" WHERE "sections"."semester_id" = 7