app/views/admin/enrollments/show.html.erb

			<p>
xxx@xxx.xxx = EnrollmentStatus.find( :all ) -%>
---
SELECT "enrollment_statuses".* FROM "enrollment_statuses" WHERE "enrollment_statuses"."id" = 1 LIMIT 1