app/views/admin/enrollments/show.html.erb

SELECT "assignments".* FROM "assignments" WHERE "assignments"."section_id" = 1 ORDER BY duedate desc
SELECT "works".* FROM "works" WHERE "works"."enrollment_id" = 3 AND (assignment_id=1) LIMIT 1
---
		</tr>
		<% @section.assignments.each do |assignment| %>
			<%
				work = @enrollment.works.where(['assignment_id=?',assignment]).first

SELECT "enrollment_statuses".* FROM "enrollment_statuses"
---
	<p>
		<%- @statuses = EnrollmentStatus.all -%>